Autodesk.Revit.DB.ValueAtPointBase.SetFlags(System.Collections.Generic.IList{System.Int32})
Independently sets the flags associated to all measurements.
Remarks:
If you set the array of flags to only contain one value, this flags value will apply to all measurements
flags:
An array of flags values. Each member corresponds to a measurement.
Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.
Number of measurements is set at creation of SpatialFieldManager in method createSpatialFieldManager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012